# AssetSetIterator Class

---
SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DB.VisualAssetSetIterator
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public abstract class AssetSetIterator : APIObject,
    	IEnumerator

    Public MustInherit Class AssetSetIterator
    	Inherits APIObject
    	Implements IEnumerator

    public ref class AssetSetIterator abstract : public APIObject,
    	IEnumerator

    [<AbstractClassAttribute>]
    type AssetSetIterator =
        class
            inherit APIObject
            interface IEnumerator
        end
The AssetSetIterator type exposes the following members.
| Name| Description
---|---|---
| AssetSetIterator| Initializes a new instance of the AssetSetIterator class
Top
| Name| Description
---|---|---
| Current|
| IsReadOnly| Identifies if the object is read-only or modifiable.(Inherited from APIObject)
Top
| Name| Description
---|---|---
| Dispose| Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject)
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| MoveNext|
| Reset|
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB.Visual Namespace